const GetChannel = ({RestClient}, id) => {
    return RestClient
        .get(`/dictionaries/channels/${id}`)
        .then(response => response.body)
};

const GetChannelsList = ({RestClient}, filter = {}, offset, size) => {
    return RestClient
        .get(`/dictionaries/channels`)
        .query({offset, size})
        .then(response => response.body)
};

const GetBranchByCode = ({RestClient}, code) => {
    let delimiterIndex = code.indexOf(":");
    if (delimiterIndex >= 0) {
        //если передали systemId вида BISQUIT:6300, то отрезаем название системы и ищем по 6300
        code = code.substr(delimiterIndex + 1);
    }
    return RestClient
        .get(`/dictionaries/branches/code=${code}`)
        .then(response => response.body)
};

const GetBranchById = ({RestClient}, id) => {
    return RestClient
        .get(`/dictionaries/branches/${id}`)
        .then(response => response.body)
};

const GetBranchesList = ({RestClient}, filter = {}, offset, size) => {
    return RestClient
        .get(`/dictionaries/branches`)
        .query({offset, size})
        .then(response => response.body)
};

const GetDivisionCode = ({RestClient}, id) => {
    return RestClient
        .get(`/dictionaries/division-codes/${id}`)
        .then(response => response.body)
};

const GetDivisionByCode = ({RestClient}, code) => {
    return RestClient
        .get(`/dictionaries/division-by-code`)
        .query({
            code: code
        })
        .then(response => response.body)
};

const GetDivisionCodesList = ({RestClient}, filter = {}, offset, size) => {
    return RestClient
        .get(`/dictionaries/division-codes`)
        .query({offset, size})
        .then(response => response.body)
};

//TODO переделать под реальный справочник
const getDocumentTypes = ({RestClient}, params) => {
    return Promise.resolve([
        {
            code: "PASSPORT_RF",
            name: "Паспорт гражданина РФ"
        },
        {
            code: "TEMPORARY_IDENTITY_CARD",
            name: "Временное удостоверение личности"
        },
        {
            code: "SOLDIER_ID",
            name: "Удостоверение личности военнослужащего"
        },
        {
            code: "MILITARY_ID",
            name: "Военный билет"
        },
        {
            code: "SAILOR_ID",
            name: "Удостоверение личности моряка"
        },
        {
            code: "CERTIFICATE_BIRTH",
            name: "Свидетельство о рождении"
        },
        {
            code: "INTERNATIONAL_PASSPORT_RF",
            name: "Заграничный паспорт гражданина РФ"
        },
        {
            code: "DIPLOMATIC_PASSPORT",
            name: "Дипломатический паспорт"
        },
        {
            code: "CERTIFICATE_EMPLOYEE_PROSECUTOR",
            name: "Служебное удостоверение работника прокуратуры"
        },
        {
            code: "SERVICE_PASSPORT",
            name: "Служебный паспорт"
        },
        {
            code: "RESIDENCE",
            name: "Вид на жительство"
        },
        {
            code: "TEMPORARY_ASYLUM_CERTIFICATE",
            name: "Свидетельство о предоставлении временного убежища"
        },
        {
            code: "FOREIGN_PASSPORT",
            name: "Паспорт иностранного гражданина"
        },
        {
            code: "TEMPORARY_RESIDENCE_PERMIT",
            name: "Разрешение на временное проживание в РФ"
        },
        {
            code: "REFUGEE_CERTIFICATE",
            name: "Удостоверение беженца"
        },
        {
            code: "OTHERS",
            name: "Иной документ"
        }
    ])
};

const GetCountriesList = ({RestClient}, params) => {
    return Promise.resolve([
        {
            code: "Российская Федерация",
            name: "Российская Федерация",
            value: "643"
        },
        {
            code: "Австралия",
            name: "Австралия",
            value: "36"
        },
        {
            code: "Австрийская Республика",
            name: "Австрийская Республика",
            value: "40"
        },
        {
            code: "Алжирская Народная Демократическая Республика",
            name: "Алжирская Народная Демократическая Республика",
            value: "12"
        },
        {
            code: "Американское Самоа",
            name: "Американское Самоа",
            value: "16"
        },
        {
            code: "Ангилья",
            name: "Ангилья",
            value: "660"
        },
        {
            code: "Антарктида",
            name: "Антарктида",
            value: "10"
        },
        {
            code: "Антигуа и Барбуда",
            name: "Антигуа и Барбуда",
            value: "28"
        },
        {
            code: "Арабская Республика Египет",
            name: "Арабская Республика Египет",
            value: "818"
        },
        {
            code: "Аргентинская Республика",
            name: "Аргентинская Республика",
            value: "32"
        },
        {
            code: "Аруба",
            name: "Аруба",
            value: "533"
        },
        {
            code: "Барбадос",
            name: "Барбадос",
            value: "52"
        },
        {
            code: "Белиз",
            name: "Белиз",
            value: "84"
        },
        {
            code: "Бермуды",
            name: "Бермуды",
            value: "60"
        },
        {
            code: "Боливарианская Республика Венесуэла",
            name: "Боливарианская Республика Венесуэла",
            value: "862"
        },
        {
            code: "Бонэйр, Синт-Эстатиус И Саба",
            name: "Бонэйр, Синт-Эстатиус И Саба",
            value: "535"
        },
        {
            code: "Босния и Герцеговина",
            name: "Босния и Герцеговина",
            value: "70"
        },
        {
            code: "Британская Территория В Индийском Океане",
            name: "Британская Территория В Индийском Океане",
            value: "86"
        },
        {
            code: "Британские Виргинские Острова",
            name: "Британские Виргинские Острова",
            value: "92"
        },
        {
            code: "Бруней-Даруссалам",
            name: "Бруней-Даруссалам",
            value: "96"
        },
        {
            code: "Буркина-Фасо",
            name: "Буркина-Фасо",
            value: "854"
        },
        {
            code: "Великое Герцогство Люксембург",
            name: "Великое Герцогство Люксембург",
            value: "442"
        },
        {
            code: "Венгрия",
            name: "Венгрия",
            value: "348"
        },
        {
            code: "Виргинские Острова Соединенных Штатов",
            name: "Виргинские Острова Соединенных Штатов",
            value: "850"
        },
        {
            code: "Восточная Республика Уругвай",
            name: "Восточная Республика Уругвай",
            value: "858"
        },
        {
            code: "Габонская Республика",
            name: "Габонская Республика",
            value: "266"
        },
        {
            code: "Гваделупа",
            name: "Гваделупа",
            value: "312"
        },
        {
            code: "Гвинейская Республика",
            name: "Гвинейская Республика",
            value: "324"
        },
        {
            code: "Гернси",
            name: "Гернси",
            value: "831"
        },
        {
            code: "Гибралтар",
            name: "Гибралтар",
            value: "292"
        },
        {
            code: "Государство Израиль",
            name: "Государство Израиль",
            value: "376"
        },
        {
            code: "Государство Катар",
            name: "Государство Катар",
            value: "634"
        },
        {
            code: "Государство Кувейт",
            name: "Государство Кувейт",
            value: "414"
        },
        {
            code: "Государство Ливия",
            name: "Государство Ливия",
            value: "434"
        },
        {
            code: "Государство Палестина",
            name: "Государство Палестина",
            value: "275"
        },
        {
            code: "Государство Эритрея",
            name: "Государство Эритрея",
            value: "232"
        },
        {
            code: "Гренада",
            name: "Гренада",
            value: "308"
        },
        {
            code: "Гренландия",
            name: "Гренландия",
            value: "304"
        },
        {
            code: "Греческая Республика",
            name: "Греческая Республика",
            value: "300"
        },
        {
            code: "Грузия",
            name: "Грузия",
            value: "268"
        },
        {
            code: "Гуам",
            name: "Гуам",
            value: "316"
        },
        {
            code: "Демократическая Республика Конго",
            name: "Демократическая Республика Конго",
            value: "180"
        },
        {
            code: "Демократическая Республика Сан-Томе И Принсипи",
            name: "Демократическая Республика Сан-Томе И Принсипи",
            value: "678"
        },
        {
            code: "Демократическая Республика Тимор-Лесте",
            name: "Демократическая Республика Тимор-Лесте",
            value: "626"
        },
        {
            code: "Демократическая Социалистическая Республика Шри-Ланка",
            name: "Демократическая Социалистическая Республика Шри-Ланка",
            value: "144"
        },
        {
            code: "Джерси",
            name: "Джерси",
            value: "832"
        },
        {
            code: "Доминиканская Республика",
            name: "Доминиканская Республика",
            value: "214"
        },
        {
            code: "Западная Сахара",
            name: "Западная Сахара",
            value: "732"
        },
        {
            code: "Иорданское Хашимитское Королевство",
            name: "Иорданское Хашимитское Королевство",
            value: "400"
        },
        {
            code: "Ирландия",
            name: "Ирландия",
            value: "372"
        },
        {
            code: "Исламская Республика Иран",
            name: "Исламская Республика Иран",
            value: "364"
        },
        {
            code: "Исламская Республика Мавритания",
            name: "Исламская Республика Мавритания",
            value: "478"
        },
        {
            code: "Исламская Республика Пакистан",
            name: "Исламская Республика Пакистан",
            value: "586"
        },
        {
            code: "Итальянская Республика",
            name: "Итальянская Республика",
            value: "380"
        },
        {
            code: "Йеменская Республика",
            name: "Йеменская Республика",
            value: "887"
        },
        {
            code: "Канада",
            name: "Канада",
            value: "124"
        },
        {
            code: "Киргизская Республика",
            name: "Киргизская Республика",
            value: "417"
        },
        {
            code: "Китайская Народная Республика",
            name: "Китайская Народная Республика",
            value: "156"
        },
        {
            code: "Княжество Андорра",
            name: "Княжество Андорра",
            value: "20"
        },
        {
            code: "Княжество Лихтенштейн",
            name: "Княжество Лихтенштейн",
            value: "438"
        },
        {
            code: "Княжество Монако",
            name: "Княжество Монако",
            value: "492"
        },
        {
            code: "Кокосовые (Килинг) Острова",
            name: "Кокосовые (Килинг) Острова",
            value: "166"
        },
        {
            code: "Корейская Народно-Демократическая Республика",
            name: "Корейская Народно-Демократическая Республика",
            value: "408"
        },
        {
            code: "Королевство Бахрейн",
            name: "Королевство Бахрейн",
            value: "48"
        },
        {
            code: "Королевство Бельгия",
            name: "Королевство Бельгия",
            value: "56"
        },
        {
            code: "Королевство Бутан",
            name: "Королевство Бутан",
            value: "64"
        },
        {
            code: "Королевство Дания",
            name: "Королевство Дания",
            value: "208"
        },
        {
            code: "Королевство Испания",
            name: "Королевство Испания",
            value: "724"
        },
        {
            code: "Королевство Камбоджа",
            name: "Королевство Камбоджа",
            value: "116"
        },
        {
            code: "Королевство Лесото",
            name: "Королевство Лесото",
            value: "426"
        },
        {
            code: "Королевство Марокко",
            name: "Королевство Марокко",
            value: "504"
        },
        {
            code: "Королевство Нидерландов",
            name: "Королевство Нидерландов",
            value: "528"
        },
        {
            code: "Королевство Норвегия",
            name: "Королевство Норвегия",
            value: "578"
        },
        {
            code: "Королевство Саудовская Аравия",
            name: "Королевство Саудовская Аравия",
            value: "682"
        },
        {
            code: "Королевство Свазиленд",
            name: "Королевство Свазиленд",
            value: "748"
        },
        {
            code: "Королевство Таиланд",
            name: "Королевство Таиланд",
            value: "764"
        },
        {
            code: "Королевство Тонга",
            name: "Королевство Тонга",
            value: "776"
        },
        {
            code: "Королевство Швеция",
            name: "Королевство Швеция",
            value: "752"
        },
        {
            code: "Кюрасао",
            name: "Кюрасао",
            value: "531"
        },
        {
            code: "Лаосская Народно-Демократическая Республика",
            name: "Лаосская Народно-Демократическая Республика",
            value: "418"
        },
        {
            code: "Латвийская Республика",
            name: "Латвийская Республика",
            value: "428"
        },
        {
            code: "Ливанская Республика",
            name: "Ливанская Республика",
            value: "422"
        },
        {
            code: "Литовская Республика",
            name: "Литовская Республика",
            value: "440"
        },
        {
            code: "Майотта",
            name: "Майотта",
            value: "175"
        },
        {
            code: "Малайзия",
            name: "Малайзия",
            value: "458"
        },
        {
            code: "Малые Тихоокеанские Отдаленные Острова Соединенных Штатов",
            name: "Малые Тихоокеанские Отдаленные Острова Соединенных Штатов",
            value: "581"
        },
        {
            code: "Мальдивская Республика",
            name: "Мальдивская Республика",
            value: "462"
        },
        {
            code: "Мартиника",
            name: "Мартиника",
            value: "474"
        },
        {
            code: "Мексиканские Соединенные Штаты",
            name: "Мексиканские Соединенные Штаты",
            value: "484"
        },
        {
            code: "Многонациональное Государство Боливия",
            name: "Многонациональное Государство Боливия",
            value: "68"
        },
        {
            code: "Монголия",
            name: "Монголия",
            value: "496"
        },
        {
            code: "Монтсеррат",
            name: "Монтсеррат",
            value: "500"
        },
        {
            code: "Народная Республика Бангладеш",
            name: "Народная Республика Бангладеш",
            value: "50"
        },
        {
            code: "Независимое Государство Папуа Новая Гвинея",
            name: "Независимое Государство Папуа Новая Гвинея",
            value: "598"
        },
        {
            code: "Независимое Государство Самоа",
            name: "Независимое Государство Самоа",
            value: "882"
        },
        {
            code: "Новая Зеландия",
            name: "Новая Зеландия",
            value: "554"
        },
        {
            code: "Новая Каледония",
            name: "Новая Каледония",
            value: "540"
        },
        {
            code: "Объединенная Республика Танзания",
            name: "Объединенная Республика Танзания",
            value: "834"
        },
        {
            code: "Объединенные Арабские Эмираты",
            name: "Объединенные Арабские Эмираты",
            value: "784"
        },
        {
            code: "Остров Буве",
            name: "Остров Буве",
            value: "74"
        },
        {
            code: "Остров Мэн",
            name: "Остров Мэн",
            value: "833"
        },
        {
            code: "Остров Норфолк",
            name: "Остров Норфолк",
            value: "574"
        },
        {
            code: "Остров Рождества",
            name: "Остров Рождества",
            value: "162"
        },
        {
            code: "Остров Херд И Острова Макдональд",
            name: "Остров Херд И Острова Макдональд",
            value: "334"
        },
        {
            code: "Острова Кайман",
            name: "Острова Кайман",
            value: "136"
        },
        {
            code: "Острова Кука",
            name: "Острова Кука",
            value: "184"
        },
        {
            code: "Острова Теркс И Кайкос",
            name: "Острова Теркс И Кайкос",
            value: "796"
        },
        {
            code: "Папский Престол (Государство - Город Ватикан)",
            name: "Папский Престол (Государство - Город Ватикан)",
            value: "336"
        },
        {
            code: "Переходное Исламское Государство Афганистан",
            name: "Переходное Исламское Государство Афганистан",
            value: "4"
        },
        {
            code: "Питкерн",
            name: "Питкерн",
            value: "612"
        },
        {
            code: "Португальская Республика",
            name: "Португальская Республика",
            value: "620"
        },
        {
            code: "Пуэрто-Рико",
            name: "Пуэрто-Рико",
            value: "630"
        },
        {
            code: "Республика Абхазия",
            name: "Республика Абхазия",
            value: "895"
        },
        {
            code: "Республика Азербайджан",
            name: "Республика Азербайджан",
            value: "31"
        },
        {
            code: "Республика Албания",
            name: "Республика Албания",
            value: "8"
        },
        {
            code: "Республика Ангола",
            name: "Республика Ангола",
            value: "24"
        },
        {
            code: "Республика Армения",
            name: "Республика Армения",
            value: "51"
        },
        {
            code: "Республика Беларусь",
            name: "Республика Беларусь",
            value: "112"
        },
        {
            code: "Республика Бенин",
            name: "Республика Бенин",
            value: "204"
        },
        {
            code: "Республика Болгария",
            name: "Республика Болгария",
            value: "100"
        },
        {
            code: "Республика Ботсвана",
            name: "Республика Ботсвана",
            value: "72"
        },
        {
            code: "Республика Бурунди",
            name: "Республика Бурунди",
            value: "108"
        },
        {
            code: "Республика Вануату",
            name: "Республика Вануату",
            value: "548"
        },
        {
            code: "Республика Гаити",
            name: "Республика Гаити",
            value: "332"
        },
        {
            code: "Республика Гайана",
            name: "Республика Гайана",
            value: "328"
        },
        {
            code: "Республика Гамбия",
            name: "Республика Гамбия",
            value: "270"
        },
        {
            code: "Республика Гана",
            name: "Республика Гана",
            value: "288"
        },
        {
            code: "Республика Гватемала",
            name: "Республика Гватемала",
            value: "320"
        },
        {
            code: "Республика Гвинея-Бисау",
            name: "Республика Гвинея-Бисау",
            value: "624"
        },
        {
            code: "Республика Гондурас",
            name: "Республика Гондурас",
            value: "340"
        },
        {
            code: "Республика Джибути",
            name: "Республика Джибути",
            value: "262"
        },
        {
            code: "Республика Замбия",
            name: "Республика Замбия",
            value: "894"
        },
        {
            code: "Республика Зимбабве",
            name: "Республика Зимбабве",
            value: "716"
        },
        {
            code: "Республика Индия",
            name: "Республика Индия",
            value: "356"
        },
        {
            code: "Республика Индонезия",
            name: "Республика Индонезия",
            value: "360"
        },
        {
            code: "Республика Ирак",
            name: "Республика Ирак",
            value: "368"
        },
        {
            code: "Республика Исландия",
            name: "Республика Исландия",
            value: "352"
        },
        {
            code: "Республика Кабо-Верде",
            name: "Республика Кабо-Верде",
            value: "132"
        },
        {
            code: "Республика Казахстан",
            name: "Республика Казахстан",
            value: "398"
        },
        {
            code: "Республика Камерун",
            name: "Республика Камерун",
            value: "120"
        },
        {
            code: "Республика Кения",
            name: "Республика Кения",
            value: "404"
        },
        {
            code: "Республика Кипр",
            name: "Республика Кипр",
            value: "196"
        },
        {
            code: "Республика Кирибати",
            name: "Республика Кирибати",
            value: "296"
        },
        {
            code: "Республика Колумбия",
            name: "Республика Колумбия",
            value: "170"
        },
        {
            code: "Республика Конго",
            name: "Республика Конго",
            value: "178"
        },
        {
            code: "Республика Корея",
            name: "Республика Корея",
            value: "410"
        },
        {
            code: "Республика Коста-Рика",
            name: "Республика Коста-Рика",
            value: "188"
        },
        {
            code: "Республика Кот Д'Ивуар",
            name: "Республика Кот Д'Ивуар",
            value: "384"
        },
        {
            code: "Республика Куба",
            name: "Республика Куба",
            value: "192"
        },
        {
            code: "Республика Либерия",
            name: "Республика Либерия",
            value: "430"
        },
        {
            code: "Республика Маврикий",
            name: "Республика Маврикий",
            value: "480"
        },
        {
            code: "Республика Мадагаскар",
            name: "Республика Мадагаскар",
            value: "450"
        },
        {
            code: "Республика Македония",
            name: "Республика Македония",
            value: "807"
        },
        {
            code: "Республика Малави",
            name: "Республика Малави",
            value: "454"
        },
        {
            code: "Республика Мали",
            name: "Республика Мали",
            value: "466"
        },
        {
            code: "Республика Мальта",
            name: "Республика Мальта",
            value: "470"
        },
        {
            code: "Республика Маршалловы Острова",
            name: "Республика Маршалловы Острова",
            value: "584"
        },
        {
            code: "Республика Мозамбик",
            name: "Республика Мозамбик",
            value: "508"
        },
        {
            code: "Республика Молдова",
            name: "Республика Молдова",
            value: "498"
        },
        {
            code: "Республика Намибия",
            name: "Республика Намибия",
            value: "516"
        },
        {
            code: "Республика Науру",
            name: "Республика Науру",
            value: "520"
        },
        {
            code: "Республика Нигер",
            name: "Республика Нигер",
            value: "562"
        },
        {
            code: "Республика Никарагуа",
            name: "Республика Никарагуа",
            value: "558"
        },
        {
            code: "Республика Ниуэ",
            name: "Республика Ниуэ",
            value: "570"
        },
        {
            code: "Республика Палау",
            name: "Республика Палау",
            value: "585"
        },
        {
            code: "Республика Панама",
            name: "Республика Панама",
            value: "591"
        },
        {
            code: "Республика Парагвай",
            name: "Республика Парагвай",
            value: "600"
        },
        {
            code: "Республика Перу",
            name: "Республика Перу",
            value: "604"
        },
        {
            code: "Республика Польша",
            name: "Республика Польша",
            value: "616"
        },
        {
            code: "Республика Сан-Марино",
            name: "Республика Сан-Марино",
            value: "674"
        },
        {
            code: "Республика Сейшелы",
            name: "Республика Сейшелы",
            value: "690"
        },
        {
            code: "Республика Сенегал",
            name: "Республика Сенегал",
            value: "686"
        },
        {
            code: "Республика Сербия",
            name: "Республика Сербия",
            value: "688"
        },
        {
            code: "Республика Сингапур",
            name: "Республика Сингапур",
            value: "702"
        },
        {
            code: "Республика Словения",
            name: "Республика Словения",
            value: "705"
        },
        {
            code: "Республика Союза Мьянма",
            name: "Республика Союза Мьянма",
            value: "104"
        },
        {
            code: "Республика Судан",
            name: "Республика Судан",
            value: "729"
        },
        {
            code: "Республика Суринам",
            name: "Республика Суринам",
            value: "740"
        },
        {
            code: "Республика Сьерра-Леоне",
            name: "Республика Сьерра-Леоне",
            value: "694"
        },
        {
            code: "Республика Таджикистан",
            name: "Республика Таджикистан",
            value: "762"
        },
        {
            code: "Республика Тринидад И Тобаго",
            name: "Республика Тринидад И Тобаго",
            value: "780"
        },
        {
            code: "Республика Уганда",
            name: "Республика Уганда",
            value: "800"
        },
        {
            code: "Республика Узбекистан",
            name: "Республика Узбекистан",
            value: "860"
        },
        {
            code: "Республика Фиджи",
            name: "Республика Фиджи",
            value: "242"
        },
        {
            code: "Республика Филиппины",
            name: "Республика Филиппины",
            value: "608"
        },
        {
            code: "Республика Хорватия",
            name: "Республика Хорватия",
            value: "191"
        },
        {
            code: "Республика Чад",
            name: "Республика Чад",
            value: "148"
        },
        {
            code: "Республика Чили",
            name: "Республика Чили",
            value: "152"
        },
        {
            code: "Республика Эквадор",
            name: "Республика Эквадор",
            value: "218"
        },
        {
            code: "Республика Экваториальная Гвинея",
            name: "Республика Экваториальная Гвинея",
            value: "226"
        },
        {
            code: "Республика Эль-Сальвадор",
            name: "Республика Эль-Сальвадор",
            value: "222"
        },
        {
            code: "Республика Южная Осетия",
            name: "Республика Южная Осетия",
            value: "896"
        },
        {
            code: "Республика Южный Судан",
            name: "Республика Южный Судан",
            value: "728"
        },
        {
            code: "Реюньон",
            name: "Реюньон",
            value: "638"
        },
        {
            code: "Руандийская Республика",
            name: "Руандийская Республика",
            value: "646"
        },
        {
            code: "Румыния",
            name: "Румыния",
            value: "642"
        },
        {
            code: "Святая Елена, Остров Вознесения, Тристан-Да-Кунья",
            name: "Святая Елена, Остров Вознесения, Тристан-Да-Кунья",
            value: "654"
        },
        {
            code: "Сен-Бартелеми",
            name: "Сен-Бартелеми",
            value: "652"
        },
        {
            code: "Сен-Мартен (Нидерландская Часть)",
            name: "Сен-Мартен (Нидерландская Часть)",
            value: "534"
        },
        {
            code: "Сен-Мартен (Французская Часть)",
            name: "Сен-Мартен (Французская Часть)",
            value: "663"
        },
        {
            code: "Сен-Пьер и Микелон",
            name: "Сен-Пьер и Микелон",
            value: "666"
        },
        {
            code: "Сент-Винсент и Гренадины",
            name: "Сент-Винсент и Гренадины",
            value: "670"
        },
        {
            code: "Сент-Китс и Невис",
            name: "Сент-Китс и Невис",
            value: "659"
        },
        {
            code: "Сент-Люсия",
            name: "Сент-Люсия",
            value: "662"
        },
        {
            code: "Сирийская Арабская Республика",
            name: "Сирийская Арабская Республика",
            value: "760"
        },
        {
            code: "Словацкая Республика",
            name: "Словацкая Республика",
            value: "703"
        },
        {
            code: "Содружество Багамы",
            name: "Содружество Багамы",
            value: "44"
        },
        {
            code: "Содружество Доминики",
            name: "Содружество Доминики",
            value: "212"
        },
        {
            code: "Содружество Северных Марианских Островов",
            name: "Содружество Северных Марианских Островов",
            value: "580"
        },
        {
            code: "Соединенное Королевство Великобритании И Северной Ирландии",
            name: "Соединенное Королевство Великобритании И Северной Ирландии",
            value: "826"
        },
        {
            code: "Соединенные Штаты Америки",
            name: "Соединенные Штаты Америки",
            value: "840"
        },
        {
            code: "Соломоновы Острова",
            name: "Соломоновы Острова",
            value: "90"
        },
        {
            code: "Социалистическая Республика Вьетнам",
            name: "Социалистическая Республика Вьетнам",
            value: "704"
        },
        {
            code: "Союз Коморы",
            name: "Союз Коморы",
            value: "174"
        },
        {
            code: "Специальный Административный Регион Китая Гонконг",
            name: "Специальный Административный Регион Китая Гонконг",
            value: "344"
        },
        {
            code: "Специальный Административный Регион Китая Макао",
            name: "Специальный Административный Регион Китая Макао",
            value: "446"
        },
        {
            code: "Султанат Оман",
            name: "Султанат Оман",
            value: "512"
        },
        {
            code: "Тайвань (Китай)",
            name: "Тайвань (Китай)",
            value: "158"
        },
        {
            code: "Тоголезская Республика",
            name: "Тоголезская Республика",
            value: "768"
        },
        {
            code: "Токелау",
            name: "Токелау",
            value: "772"
        },
        {
            code: "Тувалу",
            name: "Тувалу",
            value: "798"
        },
        {
            code: "Тунисская Республика",
            name: "Тунисская Республика",
            value: "788"
        },
        {
            code: "Турецкая Республика",
            name: "Турецкая Республика",
            value: "792"
        },
        {
            code: "Туркменистан",
            name: "Туркменистан",
            value: "795"
        },
        {
            code: "Украина",
            name: "Украина",
            value: "804"
        },
        {
            code: "Уоллис и Футуна",
            name: "Уоллис и Футуна",
            value: "876"
        },
        {
            code: "Фарерские Острова",
            name: "Фарерские Острова",
            value: "234"
        },
        {
            code: "Федеративная Демократическая Республика Непал",
            name: "Федеративная Демократическая Республика Непал",
            value: "524"
        },
        {
            code: "Федеративная Демократическая Республика Эфиопия",
            name: "Федеративная Демократическая Республика Эфиопия",
            value: "231"
        },
        {
            code: "Федеративная Республика Бразилия",
            name: "Федеративная Республика Бразилия",
            value: "76"
        },
        {
            code: "Федеративная Республика Германия",
            name: "Федеративная Республика Германия",
            value: "276"
        },
        {
            code: "Федеративная Республика Нигерия",
            name: "Федеративная Республика Нигерия",
            value: "566"
        },
        {
            code: "Федеративная Республика Сомали",
            name: "Федеративная Республика Сомали",
            value: "706"
        },
        {
            code: "Федеративные Штаты Микронезии",
            name: "Федеративные Штаты Микронезии",
            value: "583"
        },
        {
            code: "Финляндская Республика",
            name: "Финляндская Республика",
            value: "246"
        },
        {
            code: "Фолклендские Острова (Мальвинские)",
            name: "Фолклендские Острова (Мальвинские)",
            value: "238"
        },
        {
            code: "Французская Гвиана",
            name: "Французская Гвиана",
            value: "254"
        },
        {
            code: "Французская Полинезия",
            name: "Французская Полинезия",
            value: "258"
        },
        {
            code: "Французская Республика",
            name: "Французская Республика",
            value: "250"
        },
        {
            code: "Французские Южные Территории",
            name: "Французские Южные Территории",
            value: "260"
        },
        {
            code: "Центрально-Африканская Республика",
            name: "Центрально-Африканская Республика",
            value: "140"
        },
        {
            code: "Черногория",
            name: "Черногория",
            value: "499"
        },
        {
            code: "Чешская Республика",
            name: "Чешская Республика",
            value: "203"
        },
        {
            code: "Швейцарская Конфедерация",
            name: "Швейцарская Конфедерация",
            value: "756"
        },
        {
            code: "Шпицберген И Ян Майен",
            name: "Шпицберген И Ян Майен",
            value: "744"
        },
        {
            code: "Эландские Острова",
            name: "Эландские Острова",
            value: "248"
        },
        {
            code: "Эстонская Республика",
            name: "Эстонская Республика",
            value: "233"
        },
        {
            code: "Южная Джорджия и Южные Сандвичевы Острова",
            name: "Южная Джорджия и Южные Сандвичевы Острова",
            value: "239"
        },
        {
            code: "Южно-Африканская Республика",
            name: "Южно-Африканская Республика",
            value: "710"
        },
        {
            code: "Ямайка",
            name: "Ямайка",
            value: "388"
        },
        {
            code: "Япония",
            name: "Япония",
            value: "392"
        }])
};

const CreateDivisionCode = ({RestClient}, divisionCode) => {
    return RestClient
        .post(`/dictionaries/division-codes/`, divisionCode)
        .then(response => response.body)
};

const reqError = error => {
    let number = undefined;
    let text = undefined;
    let data = undefined;

    switch (error.status) {
        case 404:
            number = 404;
            text = 'Запись не найдена';
            data = error.response.body;
            break;
        default:
            text = 'Неизвестная ошибка'
    }

    return {
        error: {
            number: number,
            text: text,
            data: data
        }
    }
};

const getOfficeList = ({RestClient}) => {
    return RestClient
        .get('/dictionaries/offices')
        .then(response => response.body)
        .catch(error => {
            throw reqError(error)
        })
};

const getOfficeInfo = ({RestClient}, id) => {
    return RestClient
        .get(`/dictionaries/offices/${id}`)
        .then(response => response.body);
};

const GetExternalSystemsList = ({RestClient}, filter = {}, offset, size) => {
    return RestClient
        .get(`/dictionaries/external-systems`)
        .query({offset, size})
        .then(response => response.body)
};

const GetExternalSystem = ({RestClient}, id) => {
    return RestClient
        .get(`/dictionaries/external-systems/${id}`)
        .then(response => response.body)
};

const EditExternalSystem = ({RestClient}, externalSystem) => {
    return RestClient
        .put(`/dictionaries/external-systems/${externalSystem.id}`, externalSystem)
        .then(response => response.body)
};

const RemoveExternalSystem = ({RestClient}, id) => {
    return RestClient
        .delete(`/dictionaries/external-systems/${id}`)
        .then(response => response.body)
};

const CreateExternalSystem = ({RestClient}, externalSystem) => {
    return RestClient
        .post(`/dictionaries/external-systems/`, externalSystem)
        .then(response => response.body)
};

const getAddresses = ({RestClient}, words, parentId) => {
    return RestClient
        .get(`/dictionaries/addresses`)
        .query({words, parentId})
        .then(response => response.body)
        .then(body => ({options: body}))
};

const getHouses = ({RestClient}, addressId, house) => {
    return RestClient
        .get(`/dictionaries/addresses/${addressId}/houses`)
        .query({house})
        .then(response => response.body)
        .then(body => {
            let houses = body.map((item) => {
                item.id = 'house-' + item.housenum + item.buildnum + item.strucnum;
                item.offname = item.housenum + (item.buildnum ? (' к. ' + item.buildnum) : '') + (item.strucnum ? (' стр. ' + item.strucnum) : '');
                return item;
            });
            return {options: houses}
        })
};

const getParentsTree = ({RestClient}, addressId) => {
    return RestClient
        .get(`/dictionaries/addresses/${addressId}/parents`)
        .then(response => response.body)
};

const getBanks = ({RestClient}) => {
    return RestClient
        .get(`/dictionaries/banks`)
        .then(response => response.body)
};

const getCurrencyRates = ({RestClient}, filter, offset, size) => {
    return RestClient
        .get(`/dictionaries/rates`)
        .query({page: offset === 0 ? 0 : offset / size, size})
        .then(response => response.body)
};

const getCurrencyRate = ({RestClient}, rateId) => {
    return RestClient
        .get(`/dictionaries/rate/${rateId}`)
        .then(response => response.body)
};
const saveCurrencyRate = ({RestClient}, id, data) => {
    return RestClient
        .put(`/dictionaries/rate/${id}`)
        .send(data)
        .then(response => response.body)
};
const createCurrencyRate = ({RestClient}, data) => {
    return RestClient
        .post(`/dictionaries/rates/`)
        .send(data)
        .then(response => response.body)
};
const getCurrencyRateSetting = ({RestClient}) => {
    return RestClient
        .get(`/dictionaries/rates/setting`)
        .then(response => response.body)
};
const CetCurrencyActiveRate = ({RestClient}, id) => {
    return RestClient
        .get(`/dictionaries/currency/rate/active`)
        .query({currencyId: id})
        .then(response => response.body)
};
const getBank = ({RestClient}, bankId) => {
    return RestClient
        .get(`/dictionaries/banks/${bankId}`)
        .then(response => response.body)
};

const getCashSymbols = ({RestClient}) => {
    return RestClient
        .get(`/dictionaries/cash-symbols`)
        .then(response => response.body)
};

const getCashSymbol = ({RestClient}, id) => {
    return RestClient
        .get(`/dictionaries/cash-symbols/${id}`)
        .then(response => response.body)
};

const getCashSymbolByCode = ({RestClient}, code) => {
    return RestClient
        .get(`/dictionaries/cash-symbols`)
        .query({
            code: code
        })
        .then(response => response.body)
};

const getCurrentStateData = ({RestClient}, filter, offset, size) => {
    return RestClient
        .get(`/dictionaries/status`)
        .query({page: offset === 0 ? 0 : offset / size, size})
        .then(response => response.body)
};

export const GetExternalSystemsListAction = {
    name: 'dict.external.systems.getList',
    action: GetExternalSystemsList
};

export const GetExternalSystemAction = {
    name: 'dict.external.systems.getEntity',
    action: GetExternalSystem
};

export const EditExternalSystemAction = {
    name: 'dict.external.systems.editEntity',
    action: EditExternalSystem
};

export const RemoveExternalSystemAction = {
    name: 'dict.external.systems.removeEntity',
    action: RemoveExternalSystem
};

export const CreateExternalSystemAction = {
    name: 'dict.external.systems.createEntity',
    action: CreateExternalSystem
};

export const GetAddresses = {
    name: 'get.addresses',
    action: getAddresses
};

export const GetHouses = {
    name: 'get.houses',
    action: getHouses
};

export const GetParentsTree = {
    name: 'get.parents',
    action: getParentsTree
};

export const GetBanksAction = {
    name: 'get.banks',
    action: getBanks
};
export const GetCurrencyRatesAction = {
    name: 'get.currency.rate',
    action: getCurrencyRates
};
export const GetCurrencyRateAction = {
    name: 'get.currency.rate.by.id',
    action: getCurrencyRate
};
export const SaveCurrencyRateAction = {
    name: 'save.currency.rate',
    action: saveCurrencyRate
};
export const CreateCurrencyRateAction = {
    name: 'create.currency.rate',
    action: createCurrencyRate
};
export const GetCurrencyRateSettingsAction = {
    name: 'get.currency.rate.setting',
    action: getCurrencyRateSetting
};
export const GetCurrencyActiveRateAction = {
    name: 'get.currency.rate.active',
    action: CetCurrencyActiveRate
};

export const GetBankAction = {
    name: 'get.bank',
    action: getBank
};

export const GetChannelAction = {
    name: 'dict.channels.get',
    action: GetChannel
};

export const GetChannelsListAction = {
    name: 'dict.channels.getList',
    action: GetChannelsList
};

export const GetBranchActionById = {
    name: 'dict.branches.get.by.id',
    action: GetBranchById
};

export const GetBranchAction = {
    name: 'dict.branches.get',
    action: GetBranchByCode
};

export const GetBranchesListAction = {
    name: 'dict.branches.getList',
    action: GetBranchesList
};

export const GetDivisionByCodeAction = {
    name: 'dict.division.codes.get.by.code',
    action: GetDivisionByCode
};

export const GetDocumentTypes = {
    name: 'get.document.types',
    action: getDocumentTypes
};

export const GetCountriesListAction = {
    name: 'dict.countries.getList',
    action: GetCountriesList
};

export const GetDivisionCodeAction = {
    name: 'dict.division.codes.get',
    action: GetDivisionCode
};

export const GetDivisionCodesListAction = {
    name: 'dict.division.codes.getList',
    action: GetDivisionCodesList
};

export const CreateDivisionCodeAction = {
    name: 'dict.division.codes.createEntity',
    action: CreateDivisionCode
};

export const GetOfficeListAction = {
    name: 'dict.office-list.get',
    action: getOfficeList
};

export const GetOfficeInfoAction = {
    name: 'dict.view.get',
    action: getOfficeInfo
};

export const GetCashSymbolsListAction = {
    name: 'dict.cash-symbols.getList',
    action: getCashSymbols
};

export const GetCashSymbolAction = {
    name: 'dict.cash-symbols.get',
    action: getCashSymbol
};

export const GetCashSymbolByCodeAction = {
    name: 'dict.cash-symbols.get.by.code',
    action: getCashSymbolByCode
};
export const GetCurrentStateDataAction = {
    name: 'dict.terrorist.upload.status',
    action: getCurrentStateData
};

const GetCurrency = ({RestClient}) => {
    return RestClient
        .get(`/dictionaries/currencies`)
        .then(response => response.body)
};

export const GetCurrencyAction = {
    name: 'dict.currency.get',
    action: GetCurrency
};

export * from './print-templates'